class Command:
    DAYS_OFF = "Відпустка"


class Title:
    DAYS_OFF = f"<b>{Command.DAYS_OFF}</b>\n\n"


class Msg:
    DISCRIPTION = "1. Оберіть перший день відпустки.\n" \
                  "2. Оберіть останній день відпустки.\n" \
                  "3. Для завершення натисніть <b><i>\"Додати\"</i></b>.\n\n" \
                  "<i>Для відміни налаштувань відпустки натисніть <b>\"Очистити\"</b></i>."
    EMPTY_DAY = "--.--.----"
    ALERT_EMPTY_DAYS = "Встановіть дати відпустки або вихідного дня\n"
    ALERT_EMPTY_START_DAY = "Оберіть перший день відпустки"


class Btn:
    NO = "Ні"
    ADD = 'Додати'
    DELETE = "Видалити"
    CLEAR = "Очистити"
    NEXT = '>'
    PREV = '<'
    EMPTY = ' '
    DAYS = ['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Нд']
    MONTHS = ['0', 'Січень', 'Лютий', 'Березень', 'Квітень',
              'Травень', 'Червень', 'Липень', 'Серпень',
              'Вересень', 'Жовтень', 'Листопад', 'Грудень']
